tutorials/RAS/2DCylinderGranularFlow/0_org/p_rbgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;

            }
    top
    {
  type fixedValue;
value uniform 0;    
//  type            fixedFluxPressure;
    //    gradient        $internalField;
    }
    bottom
    {
	type 		fixedFluxPressure;
	gradient	$internalField;
    }
    
    
    //top
    //{
////		type            symmetryPlane;
     //type            fixedValue;
  //value           uniform 0;
    ////                 type            zeroGradient;


    //}
    //bottom
    //{
		////     type            zeroGradient;
        //type            fixedFluxPressure;
        //gradient        $internalField;
   
 //}
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
